import { ICamera } from "../model/camera";

export const initialCameras: ICamera[] = [
  {
    id: "camera_1",
    online: true,
    title: "Камера 1",
    uptime: "1д 16ч 3м",
    link: "https://swagatyt.gg/heatvision2",
    defects: [
      {
        id: "d1",
        name: "Повреждение",
        date: "2025-03-15T13:21:03Z",
      },
      {
        id: "d2",
        name: "Смещение",
        date: "2025-03-12T08:21:03Z",
      },
      {
        id: "d3",
        name: "Смещение",
        date: "2025-03-12T14:21:03Z",
      },
      {
        id: "d4",
        name: "Неверная сборка",
        date: "2025-03-12T19:21:03Z",
      },
      {
        id: "d5",
        name: "Повреждение",
        date: "2025-03-12T13:21:03Z",
      },
      {
        id: "d6",
        name: "Повреждение",
        date: "2025-03-12T13:21:03Z",
      },
      {
        id: "d7",
        name: "Повреждение",
        date: "2025-03-12T13:21:03Z",
      },
      {
        id: "d8",
        name: "Повреждение",
        date: "2025-03-12T13:21:03Z",
      },
      {
        id: "d9",
        name: "Повреждение",
        date: "2025-03-12T13:21:03Z",
      },
      {
        id: "d10",
        name: "Повреждение",
        date: "2025-03-12T13:21:03Z",
      },
      {
        id: "d11",
        name: "Поверхностный дефект",
        date: "2025-03-12T13:21:03Z",
      },
      {
        id: "d12",
        name: "Повреждение",
        date: "2025-03-12T14:21:03Z",
      },
      {
        id: "d13",
        name: "Повреждение",
        date: "2025-03-12T13:21:03Z",
      },
      {
        id: "d14",
        name: "Повреждение",
        date: "2025-03-12T13:21:03Z",
      },
      {
        id: "d15",
        name: "Повреждение",
        date: "2025-03-12T13:21:03Z",
      },
      {
        id: "d16",
        name: "Повреждение",
        date: "2025-03-12T13:21:03Z",
      },
      {
        id: "d17",
        name: "Смещение",
        date: "2025-03-12T07:21:03Z",
      },
      {
        id: "d18",
        name: "Смещение",
        date: "2025-03-12T14:21:03Z",
      },
      {
        id: "d19",
        name: "Неверная сборка",
        date: "2025-03-12T19:21:03Z",
      },
      {
        id: "d20",
        name: "Повреждение",
        date: "2025-03-12T13:21:03Z",
      },
      {
        id: "d21",
        name: "Скол_5_page",
        date: "2025-03-12T13:21:03Z",
      },
      {
        id: "d22",
        name: "Повреждение",
        date: "2025-03-12T13:21:03Z",
      },
      {
        id: "d23",
        name: "Повреждение",
        date: "2025-03-12T13:21:03Z",
      },
      {
        id: "d24",
        name: "Повреждение",
        date: "2025-03-12T13:21:03Z",
      },
      {
        id: "d25",
        name: "Повреждение",
        date: "2025-03-12T13:21:03Z",
      },
      {
        id: "d26",
        name: "Повреждение",
        date: "2025-03-12T13:21:03Z",
      },
      {
        id: "d27",
        name: "Повреждение",
        date: "2025-03-12T13:21:03Z",
      },
      {
        id: "d28",
        name: "Повреждение",
        date: "2025-03-12T13:21:03Z",
      },
      {
        id: "d29",
        name: "Повреждение",
        date: "2025-03-12T13:21:03Z",
      },
      {
        id: "d30",
        name: "Повреждение",
        date: "2025-03-12T13:21:03Z",
      },
      {
        id: "d31",
        name: "Повреждение",
        date: "2025-03-12T13:21:03Z",
      },
      {
        id: "d32",
        name: "Повреждение",
        date: "2025-03-12T13:21:03Z",
      },
      {
        id: "d33",
        name: "Повреждение",
        date: "2025-03-12T13:21:03Z",
      },
      {
        id: "d34",
        name: "Повреждение",
        date: "2025-03-12T13:21:03Z",
      },
      {
        id: "d35",
        name: "Повреждение",
        date: "2025-03-12T13:21:03Z",
      },
      {
        id: "d36",
        name: "Повреждение",
        date: "2025-03-12T13:21:03Z",
      },
      {
        id: "d37",
        name: "Повреждение",
        date: "2025-03-12T13:21:03Z",
      },
      {
        id: "d38",
        name: "Повреждение",
        date: "2025-03-12T13:21:03Z",
      },
      {
        id: "d39",
        name: "Поверхностный дефект",
        date: "2025-03-12T13:21:03Z",
      },
      {
        id: "d40",
        name: "Повреждение",
        date: "2025-03-12T13:21:03Z",
      },
      {
        id: "d41",
        name: "Повреждение",
        date: "2025-03-12T13:21:03Z",
      },
      {
        id: "d42",
        name: "Повреждение",
        date: "2025-03-12T13:21:03Z",
      },
      {
        id: "d43",
        name: "Повреждение",
        date: "2025-03-12T13:21:03Z",
      },
      {
        id: "d44",
        name: "Поверхностный дефект",
        date: "2025-03-12T13:21:03Z",
      },
      {
        id: "d45",
        name: "Скол_9",
        date: "2025-03-12T13:21:03Z",
      },
      {
        id: "d46",
        name: "Повреждение",
        date: "2025-03-12T13:21:03Z",
      },
      {
        id: "d47",
        name: "Повреждение",
        date: "2025-03-12T13:21:03Z",
      },
      {
        id: "d48",
        name: "Повреждение",
        date: "2025-03-12T13:21:03Z",
      },
      {
        id: "d49",
        name: "Поверхностный дефект",
        date: "2025-03-12T13:21:03Z",
      },
      {
        id: "d50",
        name: "Скол_9",
        date: "2025-03-12T13:21:03Z",
      },
      {
        id: "d51",
        name: "Повреждение",
        date: "2025-03-12T13:21:03Z",
      },
      {
        id: "d52",
        name: "Повреждение",
        date: "2025-03-12T13:21:03Z",
      },
      {
        id: "d53",
        name: "Повреждение",
        date: "2025-03-12T13:21:03Z",
      },
      {
        id: "d54",
        name: "Поверхностный дефект",
        date: "2025-03-12T13:21:03Z",
      },
      {
        id: "d55",
        name: "Скол_9",
        date: "2025-03-12T13:21:03Z",
      },
      {
        id: "d56",
        name: "Повреждение",
        date: "2025-03-12T13:21:03Z",
      },
      {
        id: "d57",
        name: "Повреждение",
        date: "2025-03-12T13:21:03Z",
      },
      {
        id: "d58",
        name: "Повреждение",
        date: "2025-03-12T13:21:03Z",
      },
      {
        id: "d59",
        name: "Поверхностный дефект",
        date: "2025-03-12T13:21:03Z",
      },
      {
        id: "d60",
        name: "Скол_12",
        date: "2025-03-12T13:21:03Z",
      },
    ],
  },
];
